In [8]:
#Q1
import pandas as pd 
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [9]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [12]:
df.tail()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [14]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [15]:
df.dtypes

col1     int64
col2     int64
col3    object
dtype: object

In [17]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [47]:
#Q2
df1 = pd.DataFrame({'A':[1,2,3],'B':[4,5,6],'C':[7,8,9]})

In [48]:
df1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [52]:
df1.reindex([1,2,4])

     A    B    C
1  2.0  5.0  8.0
2  3.0  6.0  9.0
4  NaN  NaN  NaN

In [69]:
#Q3
df = pd.DataFrame({'values':[10,20,30,40,50]})

In [75]:
df.iloc[0:3].sum()

values    60
dtype: int64

In [89]:
#Q4
data = {'text':['We are indians','can i sign ', 'also', 'calculate']}
df = pd.DataFrame(data)

In [90]:
df

             text
0  We are indians
1     can i sign
2            also
3       calculate

In [87]:
df['Word_Count']= df['text'].apply(lambda x:len(x.split()) )

In [88]:
df

             text  Word_Count
0  We are indians           3
1             can           1
2            also           1
3       calculate           1

In [94]:
#Q5  DataFrame.size() gives us the  multiplication of rows and column and DataFrame.shape() give us the number of rows and columns in a dataframe

In [95]:
#Q6 pd.read_excel()

In [96]:
#Q7
df = pd.DataFrame({'emails':['jhon.doe@gmail.com']})

In [97]:
df

               emails
0  jhon.doe@gmail.com

In [101]:
df['username']= df['emails'].str.split("@").str[0]

In [103]:
df

               emails  username
0  jhon.doe@gmail.com  jhon.doe

In [111]:
#Q8
df = pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})

In [112]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [113]:
newdf = df[(df['A']>5) & (df['B']<10)]

In [114]:
newdf

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [118]:
#Q9
df = pd.DataFrame({'A':[3,8,6,2,9]})

In [119]:
df

   A
0  3
1  8
2  6
3  2
4  9

In [120]:
df.mean()

A    5.6
dtype: float64

In [121]:
df.median()

A    6.0
dtype: float64

In [122]:
df.std()

A    3.04959
dtype: float64

In [135]:
#Q10
date = pd.date_range(start='2023-01-01' , end = '2023-01-05')

In [124]:
date

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05'],
              dtype='datetime64[ns]', freq='D')

In [145]:
df = pd.DataFrame(date)

In [152]:
df.rename(columns= {0:'date'},inplace=True)

In [153]:
df

        date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [189]:
df['weekdays']= df['date'].dt.weekday

In [190]:
df

        date  weekdays
0 2023-01-01         6
1 2023-01-02         0
2 2023-01-03         1
3 2023-01-04         2
4 2023-01-05         3

In [ ]:
#Q11